src/Documents/Доставка/Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доставка</name>
  <comment>Итоговая работа по модулю Мобильная разработка в 1С</comment>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоставок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/СтатусыДоставок/СтатусыДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоставок</name>
  <comment>mroc-diplom</comment>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>ВзятВРаботу</name>
  </enumValues>
  <enumValues>
    <name>ОтклонёнКурьером</name>
  </enumValues>
  <enumValues>
    <name>ОтклонёнКлиентом</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Доставка/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//Начало Володин А.А. 28 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	Если Статус = Перечисления.СтатусыДоставок.ОтклонёнКлиентом Или Статус = Перечисления.СтатусыДоставок.ОтклонёнКурьером Тогда
		
		ПроверяемыеРеквизиты.Добавить("Комментарий");
		Сообщить("Укажите причину отклонения!");
		
	КонецЕсли;
//Конец Володин А.А. 28 октября 2024 г.
КонецПроцедуры

#КонецОбласти
